ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульОперацияПоЯчейкамПрисвоениеШтрихкода/вмс_СерверУправляемыйМодульОперацияПоЯчейкамПрисвоениеШтрихкода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_СерверУправляемыйМодульОперацияПоЯчейкамПрисвоениеШтрихкода</name>
  <attributes>
    <name>ПараметрыОбработки</name>
  </attributes>
  <attributes>
    <name>ДанныеОбработки</name>
  </attributes>
  <attributes>
    <name>СостояниеОбработки</name>
  </attributes>
  <attributes>
    <name>ПараметрыМодуля</name>
  </attributes>
  <attributes>
    <name>ДанныеМодуля</name>
  </attributes>
  <attributes>
    <name>СостояниеМодуля</name>
  </attributes>
  <attributes>
    <name>СтандартныйМодуль</name>
    <type>
      <types>DataProcessorObject.вмс_СерверУправляемыйМодульСтандартный</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ERP DEV.WMS/src/DataProcessors/вмс_СерверУправляемыйМодульОперацияПоЯчейкамПрисвоениеШтрихкода/ObjectModule.bsl
Перем РК;  
Перем СтандартныйМодульМенеджер;
Перем ПустоеПолеОбработки;

#Область API
Функция ВыполнитьДействие(Действие) Экспорт
	
	Код = Действие.Код;
	ПараметрыДействия = Действие.Параметры;
	
	Если Код="ИнициализироватьМодульОбработки" Тогда
		
		ДействиеИнициализироватьМодульОбработки(Действие); 
		
	ИначеЕсли Код="ИнициализироватьПараметрыОбработки" Тогда
		
		ДействиеИнициализироватьПараметрыОбработки(Действие);
		
	ИначеЕсли Код="Инициализировать" Тогда
		
		ДействиеИнициализировать(Действие);  
	ИначеЕсли Код="ИнициализироватьДанныеОбработки" Тогда
		
		ДействиеИнициализироватьДанныеОбработки(Действие);
		
	ИначеЕсли Код="ИнициализироватьПоляОбработки" Тогда   
		
		ДействиеИнициализироватьПоляОбработки(Действие);    
		
	ИначеЕсли Код="ПриОткрытииФормыОбработки" Тогда
		
		ДействиеПриОткрытииФормыОбработки(Действие);
	ИначеЕсли Код="НачалоОбработки" Тогда
		
		ДействиеНачалоОбработки(Действие);  
		
	ИначеЕсли Код="ПослеЗавершенияВвода" Тогда
		
		ДействиеПослеЗавершенияВвода(Действие);  
	ИначеЕсли Код="ЗафиксироватьТранзакциюОбработки" Тогда
		
		ДействиеЗафиксироватьТранзакциюОбработки(Действие);
		
	ИначеЕсли Код="ВыборЭлементаТаблицы" Тогда
		
		ДействиеВыборЭлементаТаблицы(Действие);
		
	ИначеЕсли Код ="ОбработатьВводШтрихкода" Тогда
		
		ДействиеОбработатьВводШтрихкода(Действие);	
	ИначеЕсли Код="ВвестиДанные" Тогда
		
		ДействиеВвестиДанные(Действие);
		
	ИначеЕсли Код="ЭтоСлужебныйМодуль" Тогда   
		
		ЭтоСлужебныйМодуль = Метаданные().Имя="вмс_СерверУправляемыйМодульОперацияПоЯчейкамШаблон";
		вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, ЭтоСлужебныйМодуль);
		
	КонецЕсли;
	
	Возврат Действие.Результат;

КонецФункции
#КонецОбласти

Функция ДействиеИнициализироватьМодульОбработки(Действие)

КонецФункции

Функция ДействиеИнициализировать(Действие)

КонецФункции

Функция ДействиеИнициализироватьПоляОбработки(Действие)     
	
	ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;
	
	//Если ПараметрыИнициализации.Свойство("ДокументСсылка") Тогда
	//	УстановитьСвойстваПолейОбработки("Документ", Новый Структура("Вывод", Истина));
	//	УстановитьЗначениеДанныхПоляОбработки("Документ", ПараметрыИнициализации.ДокументСсылка)
	//КонецЕсли;

	УстановитьСвойстваПолейОбработки("Поиск", Новый Структура("Ввод, ТипЗначения, ОбязательноеЗаполнение", Истина, "Строка", "Ложь"));  
	УстановитьСвойстваЭлементовВывода("КнопкаОчиститьПоиск", Новый Структура("ТипЭлемента, Заголовок, Отображение, Картинка", "КнопкаФормы", "Очистить поиск", "Картинка", БиблиотекаКартинок.вмс_Закрыть));

	УстановитьСвойстваЭлементовВывода("ГруппаПолейПоискТриграмма", Новый Структура("Родитель, ТипЭлемента, Видимость, Группировка", "ГлавнаяПанельСтраницаВводДанных", "ГруппаФормы", "Истина", "Горизонтальная"));
	УстановитьСвойстваЭлементовВывода("ГруппаПолейУпаковки", Новый Структура("Родитель, ТипЭлемента, Видимость, Группировка", "ГлавнаяПанельСтраницаВводДанных", "ГруппаФормы", "Ложь", "Вертикальная"));
	УстановитьСвойстваЭлементовВывода("ГруппаТаблицОперации", Новый Структура("Родитель, ТипЭлемента, Видимость", "ГлавнаяПанельСтраницаВводДанных", "ГруппаФормы", "Истина"));
    УстановитьСвойстваЭлементовВывода("ГруппаКомандПодвал", Новый Структура("Родитель, ТипЭлемента, Видимость", "ГлавнаяПанельСтраницаВводДанных", "ГруппаФормы", "Ложь"));
	
	УстановитьСвойстваЭлементовВывода("Штрихкод", Новый Структура("Родитель, ТипЭлемента, ТипЗначения", "ГлавнаяПанельСтраницаВводДанных", "ПолеНадписи", "Строка"));
	УстановитьСвойстваПолейОбработки("Коэффициент", Новый Структура("Ввод, ТипЗначения, ОбязательноеЗаполнение", Истина, "Число", "Ложь"));  

	УстановитьЗначениеДанныхПоляОбработки("Коэффициент", 1);   	         
	УстановитьСвойстваЭлементовВывода("КнопкаПрисвоитьШтрихкод", Новый Структура("ТипЭлемента, Заголовок", "КнопкаФормы", "Присвоить штрихкод"));       
	//УстановитьСвойстваЭлементовВывода("КнопкаОчиститьПоиск", Новый Структура("ТипЭлемента, Заголовок, Отображение, Картинка", "КнопкаФормы", "Присвоить штрихкод", "Картинка", БиблиотекаКартинок.вмс_Закрыть));
	УстановитьСвойстваЭлементовВывода("ТоварПредставление", Новый Структура("Родитель, ТипЭлемента, ТипЗначения, Видимость, Заголовок", "ГлавнаяПанельСтраницаВводДанных", "ПолеНадписи", "Строка", "Ложь", "Товар"));  
	
	// ТУ_Прошин_18.06.26+
	Если ПараметрыИнициализации.Свойство("ОтсканированаМарка") И ПараметрыИнициализации.ОтсканированаМарка Тогда 
		УстановитьСвойстваЭлементовВывода("Коэффициент", Новый Структура("Родитель, Доступность", "ГруппаПолейУпаковки", "Ложь"));
	Иначе  
		УстановитьСвойстваЭлементовВывода("Коэффициент", Новый Структура("Родитель", "ГруппаПолейУпаковки"));
	КонецЕсли;
	//УстановитьСвойстваЭлементовВывода("Коэффициент", Новый Структура("Родитель", "ГруппаПолейУпаковки"));
	// ТУ_Прошин_18.06.26-
	
	СтандартныйМодуль.УстановитьОбработчикиСобытийЭлементовВывода("КнопкаПрисвоитьШтрихкод", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикНажатияКнопкиПрисвоитьШтрихкод")));	
    СтандартныйМодуль.УстановитьОбработчикиСобытийЭлементовВывода("КнопкаОчиститьПоиск", Новый Структура("Нажатие", НовыйОписаниеОповещения("ОбработчикНажатияКнопкиОчиститьПоиск")));
КонецФункции  

Функция ДействиеИнициализироватьДанныеОбработки(Действие)
	
	//Основная таблица операции+
	СписокНоменклатуры = РК.НоваяКоллекцияЗначений("Код, Артикул, Номенклатура, Характеристика");
	ДанныеОбработки.Таблицы.Вставить("СписокНоменклатуры", СписокНоменклатуры);
	
	УстановитьСвойстваЭлементовВывода("ГлавнаяПанельСтраницаВводДанных", Новый Структура("Заголовок", "Присвоение штрихкода"));
	УстановитьСвойстваЭлементовВывода("СписокНоменклатуры", Новый Структура("Родитель", "ГлавнаяПанельСтраницаВводДанных"));

	Если СостояниеОбработки.ПараметрыИнициализации.ВерсияМобильногоКлиента >= "2.1.3" Тогда
		УстановитьСвойстваЭлементовВывода("СписокНоменклатурыГруппаОсновныеПоля", Новый Структура("Родитель, ТипЭлемента, Вид, Группировка", "СписокНоменклатуры", "ГруппаФормы", "ГруппаКолонок", "Вертикальная"));
		УстановитьСвойстваЭлементовВывода("СписокНоменклатурыКод, СписокНоменклатурыАртикул, СписокНоменклатурыНоменклатура, СписокНоменклатурыХарактеристика", Новый Структура("Родитель", "СписокНоменклатурыГруппаОсновныеПоля"));
		ИспользоватьХарактеристики = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля().Найти("Характеристика") <> Неопределено;
		Если НЕ ИспользоватьХарактеристики Тогда       
			УстановитьСвойстваЭлементовВывода("СписокНоменклатурыХарактеристика", Новый Структура("Видимость", "Ложь")); 
		КонецЕсли;
		
	КонецЕсли;
	//-
	
	//Таблица присвоения+
	ТаблицаПрисвоения = РК.НоваяКоллекцияЗначений("Товар, Характеристика");
	ДанныеОбработки.Таблицы.Вставить("ТаблицаПрисвоения", ТаблицаПрисвоения);
		
	Если СостояниеОбработки.ПараметрыИнициализации.ВерсияМобильногоКлиента >= "2.1.3" Тогда
		УстановитьСвойстваЭлементовВывода("ТаблицаПрисвоения", Новый Структура("Видимость", "Ложь"));
	КонецЕсли;	
	//-        
	
	//Таблица товаров задания+
	//ТаблицаТоваровЗадания = РК.НоваяКоллекцияЗначений("Номенклатура, Характеристика");     
	ТаблицаТоваровЗадания = Новый ТаблицаЗначений;
	ТаблицаТоваровЗадания.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));   
	
	ТаблицаТоваровЗадания.Колонки.Добавить("Характеристика", Новый ОписаниеТипов(вмс_РаботаСКоллекциями.ЗначениеВМассив(ТипЗнч(вмс_АдаптацияКонфигураций.ПустаяХарактеристика()))));
	ДанныеОбработки.Таблицы.Вставить("ТаблицаТоваровЗадания", ТаблицаТоваровЗадания); 
	Если СостояниеОбработки.ПараметрыИнициализации.ВерсияМобильногоКлиента >= "2.1.3" Тогда
		УстановитьСвойстваЭлементовВывода("ТаблицаТоваровЗадания", Новый Структура("Видимость", "Ложь"));
	КонецЕсли;
	//-     
	 УстановитьСвойстваЭлементовВывода("Поиск, КнопкаОчиститьПоиск", Новый Структура("Родитель", "ГруппаПолейПоискТриграмма")); 
    УстановитьСвойстваЭлементовВывода("ТоварПредставление, Штрихкод, СписокНоменклатуры, ТаблицаПрисвоения, ТаблицаТоваровЗадания", Новый Структура("Родитель", "ГруппаТаблицОперации"));     
	УстановитьСвойстваЭлементовВывода("КнопкаПрисвоитьШтрихкод", Новый Структура("Родитель", "ГруппаКомандПодвал"));
	СтандартныйМодуль.СгруппироватьЭлементыВывода("ТоварПредставление, Штрихкод, СписокНоменклатуры, ТаблицаПрисвоения, ТаблицаТоваровЗадания", "Вертикальная");

	СтандартныйМодуль.СгруппироватьЭлементыВывода("ГруппаПолейПоискТриграмма, ГруппаПолейУпаковки, ГруппаТаблицОперации, ГруппаКомандПодвал", "Вертикальная");

КонецФункции  

Функция ДействиеОбработатьВводШтрихкода(Действие)

	РК = вмс_РаботаСКоллекциями;
	Действие.СтандартнаяОбработка = Ложь;  
	Действие.Обработано = Истина;
	Штрихкод = Действие.Параметры;      
	
	ВходящиеДанные = НовыеВходящиеДанные(Штрихкод); 
	ВходящиеДанные.Вставить("ПрисвоениеШтрихкода", Истина);
	ВвестиДанные(ВходящиеДанные);    
	//УстановитьРезультатДействия(Действие, Истина)     
	
	Результат = ВходящиеДанные.ДанныеШтрихкода.Результат;       
	
	Если ЗначениеЗаполнено(Результат) И Результат.НайденныеОбъекты.Количество() > 0 Тогда  
		МассивНайденныхОбъектов = РК.ВыгрузитьЗначенияКолонкиКоллекции(Результат.НайденныеОбъекты, "Объект");
		РК.УдалитьДублиВМассиве(МассивНайденныхОбъектов);
		ТекстСообщения = СтрШаблон("Отсканированный штрихкод уже назначен для %1 !", РК.МассивВСтроку(МассивНайденныхОбъектов)); 
		УстановитьСвойстваЭлементовВывода("Штрихкод", Новый Структура("Значение","")); 
		ПоказатьДиалогНаКлиенте(,ТекстСообщения);
		Возврат Ложь;	
	Иначе 
		ОтсканированныйШтрихкод = Действие.Параметры;      
		УстановитьСвойстваЭлементовВывода("Штрихкод", Новый Структура("Значение",ОтсканированныйШтрихкод)); 
	КонецЕсли;
		
КонецФункции    

Функция ДействиеВвестиДанные(Действие) 
		
КонецФункции

Функция ДействиеНачалоОбработки(Действие) 
	 
	ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;
	Если ПараметрыИнициализации.Свойство("ДокументСсылка") И ЗначениеЗаполнено(ПараметрыИнициализации.ДокументСсылка) Тогда   
		ОтсканированныйШтрихкод = ПараметрыИнициализации.Штрихкод;    
		УстановитьСвойстваЭлементовВывода("Штрихкод", Новый Структура("Значение",ОтсканированныйШтрихкод));

		Если ПараметрыИнициализации.ИзЗадания Тогда
			ТаблицаТоваров = ПараметрыИнициализации.ДокументСсылка.Товары.Выгрузить();
			ТаблицаТоваров.Свернуть("Номенклатура, Характеристика");
			
			Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
				НоваяСтрока = ДанныеОбработки.Таблицы.СписокНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара);  
				НоваяСтрока.Код = СтрокаТовара.Номенклатура.Код;
				НоваяСтрока.Артикул = СтрокаТовара.Номенклатура.Артикул;  
				
				НоваяСтрока = ДанныеОбработки.Таблицы.ТаблицаТоваровЗадания.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовара);
 
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
КонецФункции 

Функция ДействиеПриОткрытииФормыОбработки(Действие)	
	УстановитьЗаголовокФормы("Присвоение штрихкода");	
КонецФункции    

Функция ДействиеИнициализироватьПараметрыОбработки(Действие)
	Если ДействиеВыполняетсяПосле(Действие) Тогда
		ПустоеПолеОбработки = ПараметрыОбработки.ПустоеПолеОбработки;
	КонецЕсли;
КонецФункции   

Функция УстановитьЗаголовокФормы(Заголовок)

	Возврат ДобавитьДействиеНаКлиенте("УстановитьЗаголовок", Заголовок);
	
КонецФункции      

Функция ДействиеПослеЗавершенияВвода(Действие)
	  
	ДанныеПолей = Действие.МодульВызова.ДанныеОбработки.ВходящиеДанные.ДанныеПолей;
	Если ДанныеПолей.Свойство("Поиск") Тогда 
		ПоискТриграмма = ДанныеПолей.Поиск;  
		Если СтрДлина(ПоискТриграмма) > 0 Тогда
			ВыполнитьПоискТриграммаНаСервере(ПоискТриграмма);   
		КонецЕсли;
	ИначеЕсли ДанныеПолей.Свойство("Коэффициент") Тогда	
		УстановитьЗначениеДанныхПоляОбработки("Коэффициент", ДанныеПолей.Коэффициент); 	
	КонецЕсли;

КонецФункции      

Функция ДействиеЗафиксироватьТранзакциюОбработки(Действие)  
			
КонецФункции     

Процедура ВыполнитьПоискТриграммаНаСервере(ПоискТриграмма) 
	
	ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;
	ТаблицыОперации = ДанныеОбработки.Таблицы;

	ОбработаннаяСтрока = вмс_РаботаСТриграммамиВызовСервера.ОбработатьСтроку(ПоискТриграмма);
	МассивТриграммов = вмс_РаботаСТриграммамиВызовСервера.ПолучитьМассивТриграммов(ОбработаннаяСтрока);      
	
	Если ПараметрыИнициализации.Свойство("ДокументСсылка") И ЗначениеЗаполнено(ПараметрыИнициализации.ДокументСсылка) И ПараметрыИнициализации.ИзЗадания Тогда  
		
		ТаблицаТоваров = ТаблицыОперации.ТаблицаТоваровЗадания;
		ТаблицаСовпаденийТриграммов = вмс_РаботаСТриграммамиВызовСервера.ПолучитьТаблицуСовпаденийТриграммовПоТаблицеНоменклатуры(МассивТриграммов, ТаблицаТоваров);   
	Иначе		
		ТаблицаСовпаденийТриграммов = вмс_РаботаСТриграммамиВызовСервера.ПолучитьТаблицуСовпаденийТриграммов(МассивТриграммов);     
		Если вмс_АдаптацияКонфигураций.ИспользуютсяХарактеристики() Тогда
			ДополнитьТаблицуСовпаденийТриграммовХарактеристикой(ТаблицаСовпаденийТриграммов);		
		КонецЕсли;  
	КонецЕсли;
	
	ТаблицыОперации.СписокНоменклатуры.Очистить();
	
	Если ТаблицаСовпаденийТриграммов.Количество() = 0 Тогда  
		ПоказатьДиалогНаКлиенте(,"Номенклатура не найдена!");
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаСовпаденийТриграммов Цикл
		НоваяСтрока = ТаблицыОперации.СписокНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(Строка.Номенклатура);
		НоваяСтрока.Код = ДанныеНоменклатуры.Код;
		НоваяСтрока.Артикул = ДанныеНоменклатуры.Артикул;
	КонецЦикла;
		
КонецПроцедуры  

Процедура ДополнитьТаблицуСовпаденийТриграммовХарактеристикой(ТаблицаСовпаденийТриграммов)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаСовпадений.Номенклатура КАК Номенклатура,
		|	ТаблицаСовпадений.КоличествоТриграммов КАК КоличествоТриграммов
		|ПОМЕСТИТЬ ВТ_ТаблицаСовпадений
		|ИЗ
		|	&ТаблицаСовпадений КАК ТаблицаСовпадений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаСовпадений.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблицаСовпадений.КоличествоТриграммов КАК КоличествоТриграммов,
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|ИЗ
		|	ВТ_ТаблицаСовпадений КАК ВТ_ТаблицаСовпадений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО ВТ_ТаблицаСовпадений.Номенклатура = ХарактеристикиНоменклатуры.Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоличествоТриграммов УБЫВ,
		|	Номенклатура,
		|	Характеристика";
	Запрос.УстановитьПараметр("ТаблицаСовпадений", ТаблицаСовпаденийТриграммов);
	РезультатЗапроса = Запрос.Выполнить();
	
	Таблица = РезультатЗапроса.Выгрузить();
	
	ТаблицаСовпаденийТриграммов = Таблица;
КонецПроцедуры 

Функция ПолучитьДанныеНоменклатуры(Товар)
	
	Данные = Новый Структура("Код, Артикул");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Товар);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Данные, Выборка);
	
	Возврат Данные;
	
КонецФункции

Процедура ОбработатьОчисткуПоляПоискаТриграмма()  
	
	ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;     
	ВвестиДанныеПоля("Поиск","");
	
	Если ПараметрыИнициализации.Свойство("ДокументСсылка") И ЗначениеЗаполнено(ПараметрыИнициализации.ДокументСсылка) И ПараметрыИнициализации.ИзЗадания Тогда  
		
		ТаблицаТоваровЗадания = ДанныеОбработки.Таблицы.ТаблицаТоваровЗадания;  
		
		СписокНоменклатуры = ДанныеОбработки.Таблицы.СписокНоменклатуры;
		СписокНоменклатуры.Очистить();
		Для Каждого Строка Из ТаблицаТоваровЗадания Цикл
			НоваяСтрока = СписокНоменклатуры.Добавить();    
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
			ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(Строка.Номенклатура);
			НоваяСтрока.Код = ДанныеНоменклатуры.Код;
			НоваяСтрока.Артикул = ДанныеНоменклатуры.Артикул;
		КонецЦикла 
	Иначе		
		ДанныеОбработки.Таблицы.СписокНоменклатуры.Очистить();	
	КонецЕсли;
	
КонецПроцедуры       

Процедура ДействиеВыборЭлементаТаблицы(Действие)
	
	ИмяТаблицы = Действие.Параметры.ИмяТаблицы;
	ЭлементТаблицы = ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, Действие.Параметры.ИдентификаторЭлемента); 
	РК = вмс_РаботаСКоллекциями;
	
	Если ИмяТаблицы="СписокНоменклатуры" Тогда
		ДанныеСтроки = Новый Структура(РК.МассивВСтроку(вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля()));     
		ДанныеСтроки.Вставить("Артикул", ""); 
		ДанныеСтроки.Вставить("Код", ""); 
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, ЭлементТаблицы);  
		ДанныеСтроки.Товар = ЭлементТаблицы.Номенклатура;
		
		ПакетПолей = РК.СкопироватьОбъект(ДанныеСтроки);
		
		Для каждого КлючЗначение Из ДанныеСтроки Цикл 
			Если Строка(КлючЗначение.Значение) = "<>" Тогда
				ДанныеСтроки.Вставить(КлючЗначение.Ключ, "");	
			КонецЕсли;	
		КонецЦикла;
		
		ТекстВопроса = СтрШаблон("Выбрать ");
		Для Каждого КлючЗначение Из ДанныеСтроки Цикл     		
			Если КлючЗначение.Значение <> ""  Тогда 
				ТекстВопроса = ТекстВопроса + КлючЗначение.Значение + ", ";	
			КонецЕсли;
		КонецЦикла;
		ТекстВопроса = Лев(ТекстВопроса, СтрДлина(ТекстВопроса)-2) + "?";
		ТекстВопроса = СокрЛП(ТекстВопроса);       
		
		ОО = вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения("Обработчик_ВыборТовараПодтвердить", ПараметрыОбработки, ЭтотОбъект,ПакетПолей);
		ПоказатьДиалогНаКлиенте(ОО, ТекстВопроса, "ДаНет");
	КонецЕсли;
	
КонецПроцедуры 

Процедура Обработчик_ВыборТовараПодтвердить(Ответ, ПакетПолей) Экспорт   
	
	Если Ответ = "Да" Тогда    
		Коэффициент = 1;
		ОбработатьВыборТовараЗавершение(Коэффициент, ПакетПолей);	
	КонецЕсли;	
	
КонецПроцедуры   

Процедура ОбработатьВыборТовараЗавершение(Коэффициент, ДополнительныеПараметры) Экспорт   
	
	ТаблицыОперации = ДанныеОбработки.Таблицы;
	НоваяСтрока = ТаблицыОперации.ТаблицаПрисвоения.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока,ДополнительныеПараметры);     
	ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;
	
	//	НоваяСтрока.Коэффициент = Коэффициент;    
	Если ЗначениеЗаполнено(НоваяСтрока.Характеристика) Тогда
		ТоварСтрокой = Строка(НоваяСтрока.Товар) + "/" + Строка(НоваяСтрока.Характеристика);    
	Иначе 
		ТоварСтрокой = Строка(НоваяСтрока.Товар);
	КонецЕсли;    
	
	//ИспользоватьУпаковки = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля().Найти("Упаковка") <> Неопределено; 
	
	//Если ПараметрыИнициализации.Свойство("ДокументСсылка") И ЗначениеЗаполнено(ПараметрыИнициализации.ДокументСсылка) Тогда   
	//	
	//	Если НЕ ИспользоватьУпаковки Тогда 
	//		НачатьПрисвоениеШтрихкода();
	//		Возврат;
	//	КонецЕсли;	
	//КонецЕсли;
	
	Если СостояниеОбработки.ПараметрыИнициализации.ВерсияМобильногоКлиента >= "2.1.3" Тогда   
		
		УстановитьСвойстваЭлементовВывода("ГруппаПолейПоискТриграмма", Новый Структура("Видимость", "Ложь"));
		
		УстановитьСвойстваЭлементовВывода("ТоварПредставление", Новый Структура("Видимость, Значение", "Истина", ТоварСтрокой)); 
		УстановитьСвойстваЭлементовВывода("СписокНоменклатуры", Новый Структура("Видимость", "Ложь"));   
		//УстановитьСвойстваЭлементовВывода("ТаблицаПрисвоения", Новый Структура("Видимость", "Истина"));  
		УстановитьСвойстваЭлементовВывода("Штрихкод", Новый Структура("Видимость", "Истина")); 
		УстановитьСвойстваЭлементовВывода("ГруппаКомандПодвал", Новый Структура("Видимость","Истина"));
	
		//Если ИспользоватьУпаковки Тогда 
			УстановитьСвойстваЭлементовВывода("Коэффициент", Новый Структура("Видимость", "Истина"));   
			УстановитьСвойстваЭлементовВывода("ГруппаПолейУпаковки", Новый Структура("Видимость", "Истина"));
		//КонецЕсли;	
	КонецЕсли; 
	
КонецПроцедуры 

Функция ОбработчикНажатияКнопкиПрисвоитьШтрихкод(Результат, ДополнительныеПараметры) Экспорт       
	
	НачатьПрисвоениеШтрихкода();

КонецФункции  

Функция ОбработчикНажатияКнопкиОчиститьПоиск(Результат, ДополнительныеПараметры) Экспорт
	ОбработатьОчисткуПоляПоискаТриграмма();
КонецФункции

Функция НачатьПрисвоениеШтрихкода() 
	
	РК = вмс_РаботаСКоллекциями;
	ТаблицыОперации = ДанныеОбработки.Таблицы;	   
	СтрокаПрисвоения = ДанныеОбработки.Таблицы.ТаблицаПрисвоения[0]; 
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();    
	ВведенныеДанныеПолей = ПараметрыОбработки.Данные.ВведенныеДанныеПолей;      
//	Штрихкод = ВведенныеДанныеПолей.Штрихкод;                 
	ПолеВыводаШтрихкод = ПолучитьЭлементВывода("Штрихкод");   
	Если НЕ ПолеВыводаШтрихкод.Свойства.Свойство("Значение") ИЛИ НЕ ЗначениеЗаполнено(ПолеВыводаШтрихкод.Свойства.Значение) Тогда     
		ПоказатьДиалогНаКлиенте(,"Отсканируйте штрихкод!");
		Возврат Ложь;	
	КонецЕсли;
	Штрихкод = ПолеВыводаШтрихкод.Свойства.Значение;
	
	Если ВведенныеДанныеПолей.Свойство("Коэффициент") И ВведенныеДанныеПолей.Коэффициент <> Неопределено Тогда 
		Коэффициент = ВведенныеДанныеПолей.Коэффициент; 
	Иначе 
		Коэффициент = ПолучитьЗначениеДанныхПоляОбработки("Коэффициент"); 
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Штрихкод) Тогда
	//	ПоказатьДиалогНаКлиенте(,"Отсканируйте штрихкод!");
	//	Возврат Ложь;
	//КонецЕсли;	 
		
	ВыбранныйЭлемент = Новый Структура(РК.МассивВСтроку(ТоварныеПоляМассив));
    ЗаполнитьЗначенияСвойств(ВыбранныйЭлемент, СтрокаПрисвоения);
	ВыбранныйЭлемент.Вставить("Номенклатура", СтрокаПрисвоения.Товар);
	
	РезультатОпроса = Новый Структура;    
	РезультатОпроса.Вставить("Штрихкод", Штрихкод);
	РезультатОпроса.Вставить("ВыбранныйЭлемент", ВыбранныйЭлемент); 
	РезультатОпроса.Вставить("Коэффициент", Коэффициент); 
	
	ОО = вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения("ПослеЗакрытияВопросаОПрисвоении", ПараметрыОбработки, ЭтотОбъект,РезультатОпроса);
	
	Выбранно = "";
	Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
		Выбранно = Выбранно + Символы.ПС + ВыбранныйЭлемент[ИмяПоля];
	КонецЦикла;   
	
	ТекстВопроса = Прав(Выбранно, СтрДлина(Выбранно)-СтрДлина(Символы.ПС));
	ПоказатьДиалогНаКлиенте(ОО, ТекстВопроса, "ДаНетОтмена",, "Да", "Присвоить штрихкод: " + Штрихкод);
	
КонецФункции

Процедура ПослеЗакрытияВопросаОПрисвоении(Результат, Параметры) Экспорт
	
	Если Результат = "Отмена" Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихкодПрисвоен = Ложь;
	Если Результат = "Да" Тогда
		ШтрихкодПрисвоен = ПрисвоитьШтрихкодНоменклатуре(Параметры);
	КонецЕсли;         
	//3.2.4 18.06.26+
	// Если была отсканирована марка - нужно передать марку, предполагается что такая фича нужна только если присвоение из задания   
	ПараметрыИнициализации = СостояниеОбработки.ПараметрыИнициализации;
	
	Если ПараметрыИнициализации.Свойство("ОтсканированаМарка") И ПараметрыИнициализации.ОтсканированаМарка Тогда  
		вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки,ПараметрыИнициализации.Марка);
	Иначе
		вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки,Параметры.Штрихкод);
	КонецЕсли;
	//ТУ_Прошин_18.06.26-
	//вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки,Параметры.Штрихкод);
	
КонецПроцедуры  

Функция ПрисвоитьШтрихкодНоменклатуре(Параметры)  
	ШтрихкодПрисвоен = вмс_ОбработкаШтрихкодовСервер.ПрисвоитьШтрихкодНоменклатуре(Параметры);    
	Возврат ШтрихкодПрисвоен;
КонецФункции 






































//////////////////////////////////////////////////////////////////////////////////
//
//					Объявления функций+
//

#Область ОбъявленияФункций

Функция ПолучитьФормуОбработки()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПолучениеФормыОбработки"));
	
КонецФункции

Функция ОткрытьФормуОбработки(ИмяФормы)

	ДобавитьДействиеНаКлиенте("ОткрытьФормуОбработки", Новый Структура("ИмяФормы", ИмяФормы));
	
КонецФункции

Функция НачатьТранзакциюОбработки(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("НачатьТранзакциюОбработки", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция ЗафиксироватьТранзакциюОбработки(СборщикиДанных=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗафиксироватьТранзакциюОбработки", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция НовыйОписаниеОповещения(ИмяПроцедуры, знач Модуль=Неопределено, ДополнительныеПараметры=Неопределено, ИмяПроцедурыОбработкиОшибки=Неопределено, МодульОбработкиОшибки=Неопределено)
	
	Если Модуль=Неопределено Тогда
		Модуль = ЭтотОбъект;
	КонецЕсли;
	
	Возврат вмс_СерверУправляемыеОбработки.НовыйОписаниеОповещения(ИмяПроцедуры, ПараметрыОбработки, Модуль, ДополнительныеПараметры, ИмяПроцедурыОбработкиОшибки, МодульОбработкиОшибки);
	
КонецФункции

Функция ПереключитьСтраницу(ИмяСтраницы)

	Возврат СтандартныйМодуль.ПереключитьСтраницу(ИмяСтраницы);

КонецФункции

Функция ДобавитьДействиеНаКлиенте(КодДействие, знач ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.ДобавитьДействиеНаКлиенте(ПараметрыОбработки, КодДействие, ПараметрыДействия);

КонецФункции

Функция ДобавитьТаймер(ИД, Интервал_мс, знач ОписаниеОповещения=Неопределено, ВремяЗаморозки=0)
	
	Если ОписаниеОповещения=Неопределено Тогда
		//обработчик на основании имени таймера
		ОписаниеОповещения = НовыйОписаниеОповещения(ИД);
	КонецЕсли;

	Возврат СтандартныйМодуль.ДобавитьТаймер(ИД, Интервал_мс, ОписаниеОповещения, ВремяЗаморозки);
	
КонецФункции

Функция Действие(Код, ПараметрыДействия=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.Действие(Код, ПараметрыДействия, ПараметрыОбработки.Идентификатор, ПараметрыОбработки, ЭтотОбъект);
	
КонецФункции

Функция ДействиеВыполняетсяПосле(Действие)
	
	Возврат вмс_СерверУправляемыеОбработки.ДействиеВыполняетсяПосле(Действие);
	
КонецФункции

Функция УстановитьРезультатДействия(Действие, Результат=Неопределено)
	
	Возврат вмс_СерверУправляемыеОбработки.УстановитьРезультатДействия(Действие, Результат);
	
КонецФункции

Функция ВвестиДанные(ВходящиеДанные)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВвестиДанные", Новый Структура("ВходящиеДанные", ВходящиеДанные)));
	
КонецФункции

Функция ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля)
	
	Возврат СтандартныйМодуль.ВвестиДанныеПоля(ИмяПоля, ЗначениеПоля);
	
КонецФункции

Функция НовыеВходящиеДанные(Данные=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.НовыеВходящиеДанные(Данные);
	
КонецФункции

Функция ДобавитьЭтапВводаДанных(ОписаниеОбработчика, Группа, Место=Неопределено, Параметр=Неопределено, Имя=Неопределено)

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ДобавитьЭтапВводаДанных", Новый Структура("ОписаниеОбработчика, Группа, Место, Параметр, Имя", ОписаниеОбработчика, Группа, Место, Параметр, Имя)));
	
КонецФункции

Функция ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, ИдентификаторЭлемента)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементТаблицыПоИдентификатору(ИмяТаблицы, ИдентификаторЭлемента);
	
КонецФункции

Функция ОбновитьСостояниеКлиента()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ОбновитьСостояниеКлиента"));
	
КонецФункции

Функция ПараметрыТаблицы(ИмяТаблицы)
	
	Возврат СтандартныйМодуль.ПараметрыТаблицы(ИмяТаблицы);
	
КонецФункции

Функция ЗаполнитьТаблицы()

	Возврат СтандартныйМодуль.ЗаполнитьТаблицы();
	
КонецФункции

Функция ЗаполнитьДанныеПолей(СборщикиДанных=Неопределено)

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаполнитьДанныеПолей", Новый Структура("СборщикиДанных", СборщикиДанных)));
	
КонецФункции

Функция ОчиститьДанныеПолей(Поля=Неопределено, ИмяДанных=Неопределено, СборщикиДанных=Неопределено)
	
	Возврат СтандартныйМодуль.ОчиститьДанныеПолей(Поля, ИмяДанных, СборщикиДанных);
	
КонецФункции

#Область РаботаСДокументомОперацияПоЯчейкам
Функция ЗаписатьДокументОперацииПоЯчейкам(ОперацияПоЯчейкам)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ЗаписатьДокументОперацииПоЯчейкам", Новый Структура("ОперацияПоЯчейкам", ОперацияПоЯчейкам)));
	
КонецФункции

Функция ПолучитьДокументОперацииПоЯчейкам(Создавать=Истина)
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ПолучитьДокументОперацииПоЯчейкам", Новый Структура("Создавать", Создавать)));
	
КонецФункции

Функция НовыйДокументОперацииПоЯчейкам()
	
	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("НовыйДокументОперацииПоЯчейкам"));
	
КонецФункции
#КонецОбласти
Функция ЗавершитьРаботуОбработки()
	
	вмс_СерверУправляемыеОбработки.ЗавершитьРаботуОбработки(ПараметрыОбработки);
	
КонецФункции

Функция ВыполнитьЗавершениеОперации()

	Возврат вмс_СерверУправляемыеОбработки.ВыполнитьДействиеПереопределяемый(Действие("ВыполнитьЗавершениеОперации"));
	
КонецФункции

/////////////////////////////////////////////////////////////////////////
//
//				Поля обработки+
//

Функция УстановитьОбработчикиСобытийПолейОбработки(Поля=Неопределено, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийПолейОбработки(Поля, События);
	
КонецФункции

Функция ВосстановитьИсходныеСвойстваПолейОбработки(Поля=Неопределено)

	Возврат СтандартныйМодуль.ВосстановитьИсходныеСвойстваПолейОбработки(Поля);
	
КонецФункции

//возвращает всю таблицу полей или массив полей по отбору
Функция ПоляОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляОбработки(ПараметрыОбработки, Отбор);

КонецФункции

Функция ПолеОбработки(Отбор)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолеОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

//возвращает поля с указанными именами, если поля нет, то создает новое
Функция ПолучитьПоляОбработки(Поля=Неопределено)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьПоляОбработки(ПараметрыОбработки, Поля);

КонецФункции

Функция УстановитьСвойстваПолейОбработки(Поля=Неопределено, Свойства=Неопределено, Значение=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьСвойстваПолейОбработки(ПараметрыОбработки, Поля, Свойства, Значение);
	
КонецФункции

Функция ПолучитьЗначениеСвойстваПоляОбработки(Поле, ИмяСвойства)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеСвойстваПоляОбработки(ПараметрыОбработки, Поле, ИмяСвойства);
	
КонецФункции

Функция УстановитьПоляВводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция УстановитьПоляВыводаОбработки(Поля)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьПоляВыводаОбработки(ПараметрыОбработки, Поля);
	
КонецФункции

Функция СписокПолейВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВвода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВвода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВвода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейВывода(ПараметрыОбработки);
	
КонецФункции

Функция ПоляВывода()
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПоляВывода(ПараметрыОбработки);
	
КонецФункции

Функция СписокПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.СписокПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ТаблицаПолейОбработки(Отбор=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ТаблицаПолейОбработки(ПараметрыОбработки, Отбор);
	
КонецФункции

Функция ПолучитьЗначениеДанныхПоляОбработки(Поле)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПолучитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле);
	
КонецФункции

Функция УстановитьЗначениеДанныхПоляОбработки(Поле, Значение)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.УстановитьЗначениеДанныхПоляОбработки(ПараметрыОбработки, Поле, Значение);
	
КонецФункции

Функция ПрочитатьПутиКДаннымПолей(ПолеПути, Поля=Неопределено)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ПрочитатьПутиКДаннымПолей(ПараметрыОбработки, ПолеПути, Поля);
	
КонецФункции

Функция ЗаписатьПутиКДаннымПолей(ПолеПути, ТаблицаПутейКДаннымПолей)

	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЗаписатьПутиКДаннымПолей(ПараметрыОбработки, ПолеПути, ТаблицаПутейКДаннымПолей);
	
КонецФункции

//
//				Поля обработки-
//
/////////////////////////////////////////////////////////////////////////

Функция СборщикиДанных(Отбор=Неопределено) Экспорт
	
	Возврат СтандартныйМодуль.СборщикиДанных(Отбор);
	
КонецФункции

Функция СборщикДанных(Отбор) Экспорт
	
	Возврат СтандартныйМодуль.СборщикДанных(Отбор);
	
КонецФункции

Функция УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События)
	
	Возврат СтандартныйМодуль.УстановитьОбработчикиСобытийЭлементовВывода(Элементы, События);
	
КонецФункции

Функция УстановитьСвойстваЭлементовВывода(Элементы, Свойства=Неопределено, ЗначениеСвойства=Неопределено)
	
	Возврат СтандартныйМодуль.УстановитьСвойстваЭлементовВывода(Элементы, Свойства, ЗначениеСвойства);
	
КонецФункции

Функция ПолучитьЭлементВывода(Имя)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементВывода(Имя);
	
КонецФункции

Функция ПолучитьЭлементВыводаДляПоляОбработки(ЭлементВывода, ПолеДанныхЭлемента=Неопределено)
	
	Возврат СтандартныйМодуль.ПолучитьЭлементВыводаДляПоляОбработки(ЭлементВывода, ПолеДанныхЭлемента);
	
КонецФункции

Функция ЭлементВывода(ОтборЭлемента)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЭлементВывода(ПараметрыОбработки, ОтборЭлемента);
	
КонецФункции

Функция ЭлементыВывода(ОтборЭлементов)
	
	Возврат Обработки.вмс_СерверУправляемыйМодульСтандартный.ЭлементыВывода(ПараметрыОбработки, ОтборЭлементов);
	
КонецФункции

Функция ПоказатьДиалогНаКлиенте(знач ОписаниеОповещения=Неопределено, Текст, знач Кнопки=Неопределено, знач Таймаут=Неопределено, КнопкаПоУмолчанию=Неопределено, Заголовок=Неопределено, ИмяЗвука="Сигнал")
	
	Если ТипЗнч(ОписаниеОповещения)=Тип("Строка") Тогда
		ОписаниеОповещения = НовыйОписаниеОповещения(ОписаниеОповещения);
	КонецЕсли;
	
	Возврат СтандартныйМодуль.ПоказатьДиалогНаКлиенте(ОписаниеОповещения, Текст, Кнопки, Таймаут, КнопкаПоУмолчанию, Заголовок, ИмяЗвука);
	
КонецФункции
#КонецОбласти

//
//					Объявления функций-
//
//////////////////////////////////////////////////////////////////////////////////

РК = вмс_РаботаСКоллекциями;
